routes/web.php


Route::get('/', function () {

        return view('posts', [
            'posts' => Post::latest()->get(),
            'categories' => Category::all()
        ]);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `categories`



Route::get('categories/{category:slug}', function (Category $category){
        return view('posts',[
            'posts' => $category->posts,
            'currentCategory' => $category,
            'categories'=> Category::all()
        ]);
---
SELECT * FROM `posts` WHERE `posts`.`category_id` = 2 and `posts`.`category_id` IS not NULL
SELECT * FROM `categories`